app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "5xds6lbsc"], ["introduction", "el1luwkihsvtmy1uogr"], ["updated_at", "2021-07-02 13:32:23.880381"], ["id", 2]]